nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE2_REG</name>
      <description>BLE2_REG</description>
      <groupName>BLE2_REG</groupName>
      <baseAddress>0xA9020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFF</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BLE_REG_TXRX_CCM_SESSION_KEY_0</name>
          <description>Session Key 0 for CCM Operation</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([31:0] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_SESSION_KEY_1</name>
          <description>Session Key 1 for CCM Operation</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([63:32] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_SESSION_KEY_2</name>
          <description>Session Key 2 for CCM Operation</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([95:64] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_SESSION_KEY_3</name>
          <description>Session Key 3 for CCM Operation</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_key</name>
              <description>CCM Session Key ([127:96] of 128-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_INIT_VEC_0</name>
          <description>Initialization Vector 0 for CCM Operation</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_iv</name>
              <description>CCM Initialization Vector ([31:0] of 64-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_INIT_VEC_1</name>
          <description>Initialization Vector 1 for CCM Operation</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_iv</name>
              <description>CCM Initialization Vector ([63:32] of 64-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TX_CCM_PKT_CNT_0</name>
          <description>Transmit CCM Packet Count 0</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pkt_cnt</name>
              <description>Tx Packet Count ([31:0] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TX_CCM_PKT_CNT_1</name>
          <description>Transmit CCM Packet Count 1</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_pkt_cnt</name>
              <description>Tx Packet Count ([38:32] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_RX_CCM_PKT_CNT_0</name>
          <description>Receive CCM Packet Count 0</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_cnt</name>
              <description>Rx Packet Count ([31:0] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_RX_CCM_PKT_CNT_1</name>
          <description>Receive CCM Packet Count 1</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_cnt</name>
              <description>Rx Packet Count ([38:32] of 39-bit)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CNTRL</name>
          <description>Transmit/Receive Packet Control</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>conn_event_role</name>
              <description>Connection event Role</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>slave</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>data_chan_pkt</name>
              <description>Channel to Distinguish pkt_header Fields</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>advt channel</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>data channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rx_data_rate</name>
              <description>LE Rx Packet Data Rate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Rx packet data rate 1 Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Rx packet data rate 2 Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>tx_data_rate</name>
              <description>LE Tx Packet Data Rate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Tx packet data rate 1 Mbps</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Tx packet data rate 2 Mbps</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>data_length_ext</name>
              <description>LE Data Length Extension</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable; support up to 31 bytes of payload for data channel PDU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable; support up to 255 bytes, or 251 bytes for encryption packet, of payload for data channel PDU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>advt_length_ext</name>
              <description>LE Advertising Length Extension</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>disable; support up to 37 bytes of payload for advertising channel PDU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>enable; support up to 255 bytes of payload for advertising channel PDU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>iso_pdu_sel</name>
              <description>Select ISO PDU type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>data_chan_pkt=0 selects Data PDU. data_chan_pkt=1 selects Adv PDU</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>data_chan_pkt=0 selects BIS PDU. data_chan_pkt=1 selects CIS PDU</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>direct_test_mode</name>
              <description>BLE direct test mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>BLE in normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>BLE in direct test mode (bypass Rx packet length &lt; 6 check in adv mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>channel_index</name>
              <description>Channel Index Value for Whitening Initialization</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_en</name>
              <description>Tx Extension Packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>transmit data extension; regular, non-location BLE transmit packet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>transmit data extension; transmit extension field for current packet</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>whit_dis</name>
              <description>Disable Whitening</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rx_length_max</name>
              <description>Maximum Length for rx_length_err</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_extn_length</name>
              <description>Tx Extension Length for Tx DFE Packet</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_rf_agc_index</name>
              <description>BRF Rx Power Control Index</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CRC_INIT_VAL</name>
          <description>CRC Initialization Value</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>crc_init_value</name>
              <description>CRC Initialization Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TX_ACC_ADDR</name>
          <description>Tx Access Address, for Advt and Data Packets</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>tx_access_address</name>
              <description>Access Address for Tx Packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_RX_PKT_STATUS</name>
          <description>Rx Packet Status, for Advt and Data Packets</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>rx_pkt_header</name>
              <description>Rx Packet PDU Header</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rx_extn_suppl_info</name>
              <description>Rx Packet Supplemental Info Byte if available</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>simul_scan_coded_en</name>
              <description>Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Detected BLE 1M Packet Correlation Hit or no correlation at all in Simultaneous Scan Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Detected Rx Coded Packet Correlation Hit in Simultaneous Scan Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rx_preamble_match_sts</name>
              <description>Detected Rx Preamble Match during BLE Long Range RX</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Preamble has not been detected on most recent RX in long range mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>Preamble has been detected on most recent RX in long range mode. This indication resets at the start of next RX</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CCM_CNTRL</name>
          <description>CCM Operation (encryption/authentication) Control</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ccm_en_tx</name>
              <description>CCM (Encryption/Authentication) Enable for Tx packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ccm_en_rx</name>
              <description>CCM (Encryption/Authentication) Enable for Rx packet</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auth_disable_tx</name>
              <description>When ccm_en_tx = 1, setting 1 for CCM Enable for Tx Packet with encryption only and no authentication.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>auth_disable_rx</name>
              <description>When ccm_en_rx = 1, setting 1 for CCM Enable for Rx Packet with encryption only and no authentication.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inc_Tx_Pkt_Cnt</name>
              <description>Increment Tx CCM Packet Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>inc_Rx_Pkt_Cnt</name>
              <description>Increment Rx CCM Packet Count</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sk_decip_go</name>
              <description>Manually Invoke SK_Decipher Function</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_REG_TXRX_CORHIT_QUS_TIMESTAMP</name>
          <description>Quarter microsecond level timestamp</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>corhit_timestamp_qus</name>
              <description>QUS level timestamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
