nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
        <register>
          <name>BTU_RIF_BLE_CLK_GATING</name>
          <description>RIF BLE Clock Gating</description>
          <addressOffset>0xCF8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_ble_sleep_clk_en</name>
              <description>BLE Sleep Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_force_clk_en</name>
              <description>BLE Force Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_ble_slv_hclk_en</name>
              <description>BLE Slave HCLK Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_slv_hclk_en controls clock gating dynamically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_sys_td_clk_en to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_mst_hclk_en</name>
              <description>BLE Master HCLK Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_mst_hclk_en controls clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_mst_hclk to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_ric_sys_clk_en</name>
              <description>BLE RIC System Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_ric_sys_clk_en controls dynamic clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>force ble_ric_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_tx_clk_en</name>
              <description>BLE Tx Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_tx_clk_en controls clock gating for ble_tx_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_tx_clk; also forces ble_td_sys_clk_en to be set</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_rx_clk_en</name>
              <description>BLE Rx Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_rx_clk controls clock gating dynamically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_rx_clk clocks to turn on; also forces ble_rd_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_td_sys_clk_en</name>
              <description>BLE TD System Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_td_sys_clk_en controls clock gating dynamically</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_td_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_rd_sys_clk_en</name>
              <description>BLE RD System Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_rd_sys_clk_en controls dynamic clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_rd_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_rl_sys_clk_en</name>
              <description>BLE RD System Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_rl_sys_clk_en controls dynamic clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces forces ble_rl_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_wl_sys_clk_en</name>
              <description>BLE Whitelist Search System Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_wl_sys_clk_en controls dynamic clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_wl_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_reg_ble_irk_sys_clk_en</name>
              <description>BLE IRK resolve System Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v0</name>
                  <description>ble_irk_sys_clk_en controls dynamic clock gating</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>v1</name>
                  <description>forces ble_irk_sys_clk to turn on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_CLK_CTRL</name>
          <description>RIF BLE Clock Control</description>
          <addressOffset>0xCFC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>bt_reg_force_ble_clk_req_zero</name>
              <description>Force BLE Clock Req Zero</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_reg_force_ble_clk_req_one</name>
              <description>Force BLE Clock Req One</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_awake_sts</name>
              <description>BLE Awake Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ble_clk_req_early_assert</name>
              <description>ble_clk_req early assertion upon any BLE AHB access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sys_4m_early_ungate</name>
              <description>ble_sys_clk and ble_4m_clk early ungated upon any BLE AHB access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_TX_PKT_END</name>
          <description>BLE RIF dBus Tx Packet End Control</description>
          <addressOffset>0xD00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1E</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Pkt_End_Delay</name>
              <description>dBus Tx Packet End Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_RX_PKT_END</name>
          <description>BLE RIF dBus Rx Packet End Control</description>
          <addressOffset>0xD02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Pkt_End_Delay</name>
              <description>dBus Rx Packet End Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_TX_RAMPDOWN</name>
          <description>BLE RIF dBus Tx Rampdown Control</description>
          <addressOffset>0xD04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Rampdown_Delay</name>
              <description>dBus Tx Rampdown Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_DBUS_RSSI</name>
          <description>BLE RIF dBus RSSI</description>
          <addressOffset>0xD06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_RSSI_Delay</name>
              <description>Delay from RSSI trigger to start of RSSI read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_SEL_PRI_HIGH</name>
          <description>PTA High Priority Select for RIF_ARB Arbitration</description>
          <addressOffset>0xF00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>msSwitchPri</name>
              <description>Master / Slave Switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pagePri</name>
              <description>Page</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pScanPri</name>
              <description>Page Scan</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inqPri</name>
              <description>Inquiry</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iScanPri</name>
              <description>Inquiry Scan</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitTxPri</name>
              <description>LLR Initiator Tx priority</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitRxPri</name>
              <description>LLR Initiator Rx priority</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoInstPri</name>
              <description>eSCO Instant</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoRetrPri</name>
              <description>eSCO Retransmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>scoPri</name>
              <description>SCO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>broadcastPri</name>
              <description>Broadcast</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aclPri</name>
              <description>ACL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iRespPri</name>
              <description>Inquiry Response</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slvRespPri</name>
              <description>Slave Page Response</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pollPri</name>
              <description>Poll packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mstrRespPri</name>
              <description>Master Page Response</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_CTRL</name>
          <description>PTA Control</description>
          <addressOffset>0xF02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>btc_priority_mode</name>
              <description>BTC BCA Coex Priority Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zero</name>
                  <description>BTC BCA coex priority is the same as PTA coex priority for RIF_ARB arbitration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one</name>
                  <description>BTC BCA coex priority is from packet transaction request which falls in BTU_PTA_SEL_BCA_PRI_HIGH/BTU_PTA_SEL_BCA_PRI_MED category</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>btc_use_sam</name>
              <description>SAM Coexistence Feature Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slvNoRespAbort</name>
              <description>Slave No Response Abort Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>Deasserts after Rx-to-Tx slot change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>Deasserts immediately after HEC received</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_grant_bypass_en</name>
              <description>BCA coex grant bypass enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable bt_grant_n bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable bt_grant_n bypass</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_grant_bypass_val</name>
              <description>BCA coex grant bypass value</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>set BCA coex grant bt_grant_n to zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>set BCA coex grant bt_grant_n to one</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>clrAllTxCntrs</name>
              <description>Clear All Tx Counters</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>do not clear counters</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>clear counters</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>aclPriIncEn</name>
              <description>ACL Priority Escalation Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>mrvlCoexExitEn</name>
              <description>Marvell Coexistence Exit Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
