nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
        <register>
          <name>BTU_PTA_REQ_DELAY_TIMER</name>
          <description>PTA Bt_Req Delay Timer</description>
          <addressOffset>0xF04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_req_delay</name>
              <description>PTA Request Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_SEL_PRI_MED</name>
          <description>PTA Medium Priority Select for RIF_ARB Arbitration</description>
          <addressOffset>0xF12</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>msSwitchPri</name>
              <description>Master / Slave Switch</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pagePri</name>
              <description>Page</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pScanPri</name>
              <description>Page Scan</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>inqPri</name>
              <description>Inquiry</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iScanPri</name>
              <description>Inquiry Scan</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitTxPri</name>
              <description>LLR Initiator Tx priority</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>llrInitRxPri</name>
              <description>LLR Initiator Rx priority</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoInstPri</name>
              <description>eSCO Instant</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>eScoRetrPri</name>
              <description>eSCO Retransmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>scoPri</name>
              <description>SCO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>broadcastPri</name>
              <description>Broadcast</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>aclPri</name>
              <description>ACL</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>iRespPri</name>
              <description>Inquiry Response</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slvRespPri</name>
              <description>Slave Page Response</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>pollPri</name>
              <description>Poll packet</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>mstrRespPri</name>
              <description>Master Page Response</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_BLE_RIF_ARB_COEX_PRI</name>
          <description>BLE PTA Priority for BTC/BLE arbitration</description>
          <addressOffset>0xF14</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_pri</name>
              <description>BLE Coex Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri</name>
              <description>BLE Coex Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_BLE_BCA_COEX_PRI</name>
          <description>BLE PTA Priority for BCA arbitration</description>
          <addressOffset>0xF16</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_tx_pri</name>
              <description>BLE Coex Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_rx_pri</name>
              <description>BLE Coex Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_INACTIVITY_REFCLK_0</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsInactMsg_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_INACTIVITY_REFCLK_1</name>
          <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF1A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsInactMsg_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MWS_INACTIVITY_REFPDB_CNT</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
          <addressOffset>0xF1C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>mwsInactMsg_pdBitCnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on MWS_Inact_Msg_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_INBAND_FREQ_SET_1</name>
          <description>PTA Inband Frequency Set 0</description>
          <addressOffset>0xF1E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT_In_Band_Lo</name>
              <description>Bluetooth In Band Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_In_Band_Hi</name>
              <description>Bluetooth In Band High</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_MODE_SELECT</name>
          <description>PTA Mode Select</description>
          <addressOffset>0xF20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT_Coex_Mode</name>
              <description>Bluetooth Coexistence Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V00</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V01</name>
                  <description>CSR mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V10</name>
                  <description>MRVL mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V11</name>
                  <description>SUSHI mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_Mws_Coex_En</name>
              <description>Bluetooth and MWS Coexistence Mode Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_ovlp_mode</name>
              <description>Bluetooth Overlap Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>non-filtered, old design</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>filtered mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ovlp_supress_en</name>
              <description>Overlap Suppression Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable BT_Overlap/BT_Scan_Overlap assertion to BCA will be suppressed if Tx_Power_Index Value is less than the programmed BTU_PTA_TX_POWER_THRESHOLD for BR/EDR packet type or is less than BTU_PTA_BLE_TX_PWR_THRHD for BLE packet.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_scan_ovlp_mode</name>
              <description>Bluetooth Scan Overlap Mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>non-filtered, old design</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>filtered mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>bt_scan_ovlp_rx_en</name>
              <description>Scan Overlap for Bluetooth Rx</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BT_3dg_Coex_En</name>
              <description>Bluetooth and 3D-Glass Coexistence Mode Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_In_Band1_Freq_En</name>
              <description>BTU_PTA_INBAND_FREQ_SET_1 Band Gap Use Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bt_tx_on_mode</name>
              <description>BT_TX_ON mode selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_INBAND_FREQ_SET_0</name>
          <description>PTA Inband Frequency Set 1</description>
          <addressOffset>0xF22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BT_In_Band_Lo</name>
              <description>Bluetooth In Band Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_In_Band_Hi</name>
              <description>Bluetooth In Band High</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_HARQ_PATTERN_SEL_REFCLK_0</name>
          <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqPatternSel_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_HARQ_PATTERN_SEL_REFCLK_1</name>
          <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF26</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqPatternSel_refClk</name>
              <description>Bluetooth Reference Clock Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_HARQ_PATTERN_SEL_REFPDB_CNT</name>
          <description>Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
          <addressOffset>0xF28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqPatternSel_pdBitCnt</name>
              <description>Bluetooth Reference pdBitCounter Snapshot on HARQ_Pattern_Sel_Real_Int Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_HARQ_PATTERN_SEL_VAL</name>
          <description>MWS Coex Signal HARQ_PATTERN_SEL Value</description>
          <addressOffset>0xF2A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>harqPatternSelReg</name>
              <description>MWS Coex Signal HARQ_PATTERN_SEL Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>mwsInactMsgReg</name>
              <description>MWS Coex Signal MWS_INACT_MSG Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_INFO_DELAY_TIMER</name>
          <description>PTA Info Delay Timer</description>
          <addressOffset>0xF2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>pta_info_delay</name>
              <description>Bluetooth Sniff Interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_PTA_BLE_SYNC_CTRL</name>
          <description>PTA BLE Sync Control</description>
          <addressOffset>0xF32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_sync_priority</name>
              <description>BLE Sync Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_dir</name>
              <description>BLE Sync Direction</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>Rx first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>Tx first</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ble_sync_frame_fw_val</name>
              <description>BLE Sync Frame Firmware Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ble_sync_frame_extend</name>
              <description>BLE Sync Frame Extend</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>sync_frame value will be de-asserted at falling edge of bt_req</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>sync_frame value will be extended</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
