nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
        <register>
          <name>WB_RSSI_CTRL</name>
          <description>Wide-Band RSSI Control</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x223222</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_N_WINDOW_WB</name>
              <description>WB RSSI N Window Averager Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_M_WINDOW_WB</name>
              <description>WB RSSI M Window Averager Factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_F_WINDOW_WB</name>
              <description>WB RSSI F Window Averager Factor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_DB_EN_WB</name>
              <description>WB RSSI dB Calculate Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEP_RSSI_RESULT_WB</name>
              <description>Keep WB RSSI Result 1: the WB-RSSI results will be kept until next update/refresh 1: the WB-RSSI results will be cleared when rssi_init asserts</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_N_WINDOW_WB_DRS</name>
              <description>DRS WB RSSI N Window Averager Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_F_WINDOW_WB_DRS</name>
              <description>DRS WB RSSI F Window Averager Factor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_ADJ_WB</name>
              <description>WB RSSI Adjust Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_RSSI_RES0</name>
          <description>Wide-Band RSSI Result 0</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_WB</name>
              <description>WB RSSI Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_RDY_WB</name>
              <description>This bit is set when RSSI_WB value ready to read(or updated) and is cleared by rx_init or write &quot;1&quot; to this field(W1C)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_RAW_WB</name>
              <description>WB Raw RSSI Result</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_RSSI_RES1</name>
          <description>Wide-Band RSSI Result 1</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ED_WB</name>
              <description>WB RSSI ED Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_STATE_WB</name>
              <description>WB RSSI CCA1 State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_COMPLETE_WB</name>
              <description>WB RSSI Measure Complete</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WB_RSSI_DFT</name>
          <description>Wide-Band RSSI DFT Result</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SLOW_MAG</name>
              <description>WB RSSI Slow Magnitude Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_MAG</name>
              <description>WB RSSI Fast Magnitude Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_CTRL0</name>
          <description>Narrow-Band RSSI Control 0</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x400022</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_N_WINDOW_NB</name>
              <description>NB RSSI N Window Averager Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_M_WINDOW_NB</name>
              <description>NB RSSI M Window Averager Factor</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_IIR_WAIT_NB</name>
              <description>NB RSSI IIR Filter Initial Wait Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_IIR_WT_NB</name>
              <description>NB RSSI IIR Filter Factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNR_ADJ_NB</name>
              <description>NB RSSI SNR Adjust Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEP_RSSI_RESULT_NB</name>
              <description>When enabled, the NB-RSSI results will keep until next update/refresh, or the NB-RSSI results will be cleared when rx_init or rssi_init asserts</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_ADJ_NB</name>
              <description>NB RSSI Adjust Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_CTRL1</name>
          <description>Narrow-Band RSSI Control 1</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI_RSSI_WEIGHT</name>
              <description>RSSI Weight For LQI Calulation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_SNR_WEIGHT</name>
              <description>SNR Weight For LQI Calculation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_RSSI_SENS_ADJ</name>
              <description>LQI Sensitivity Adjust Value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LQI_BIAS</name>
              <description>LQI Bias Value</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_RES0</name>
          <description>Narrow-Band RSSI Result 0</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80800100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSI_NB</name>
              <description>NB RSSI Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_RDY_NB</name>
              <description>This bit set when RSSI_NB/SNR_NB/LQI_NB/ED_NB value ready to read(or updated) and cleared by rx_init or write &quot;1&quot; to this field(W1C)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_RAW_NB</name>
              <description>Raw NB RSSI Result</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NOISE_RSSI_RAW_NB</name>
              <description>Raw Noise Result</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_RES1</name>
          <description>Narrow-Band RSSI Result 1</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ED_NB</name>
              <description>NB RSSI ED Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LQI_NB</name>
              <description>NB RSSI LQI Result</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNR_NB</name>
              <description>NB RSSI SNR Result</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA1_STATE_NB</name>
              <description>NB RSSI CCA1 State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_COMPLETE_NB</name>
              <description>NB RSSI Measure Complete</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NB_RSSI_DFT</name>
          <description>Narrow-Band RSSI DFT Result</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVG_NOISE_MAG_NB</name>
              <description>NB RSSI Averaged Noise Magnitude Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVG_MAG_NB</name>
              <description>NB RSSI Averaged Magnitude Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
