nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
        <register>
          <name>AGC_THR_MIS</name>
          <description>AGC Miscellaneous Thresholds</description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x140028</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELTA_SLOW_THR</name>
              <description>STEP_UP_THR_VLG2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOLD_MARGIN_THR</name>
              <description>STEP_UP_THR_VLG2large</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AGC_OVRD</name>
          <description>AGC Override Control</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_GAIN_OVRD</name>
              <description>AGC gain config override values</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_GAIN_OVRD_EN</name>
              <description>AGC gain config override enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_GAIN_IDX_OVRD</name>
              <description>AGC gain index override value.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_GAIN_IDX_OVRD_EN</name>
              <description>AGC gain index override enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_PHY_HOLD_OVRD</name>
              <description>PHY_HOLD_TRIG signal override value</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_PHY_HOLD_OVRD_EN</name>
              <description>PHY_HOLD_TRIG signal override enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_PHY_FREEZE_OVRD</name>
              <description>PHY_FREEZE_TRIG signal override value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AGC_PHY_FREEZE_OVRD_EN</name>
              <description>PHY_FREEZE_TRIG signal override enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_RESID_CTRL</name>
          <description>DC Residual Control</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC_RESID_NWIN</name>
              <description>DC Residual NWIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_ITER_FREEZE</name>
              <description>DC Residual Iteration Freeze</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_ALPHA</name>
              <description>DC Residual Alpha</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_0</name>
                  <description>Update factor is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_1</name>
                  <description>Update factor is 1/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_2</name>
                  <description>Update factor is 1/4 + 1/8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_3</name>
                  <description>Update factor is 1/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_4</name>
                  <description>Update factor is 1/8 + 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_5</name>
                  <description>Update factor is 1/8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_6</name>
                  <description>Update factor is 1/16 + 1/32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA_7</name>
                  <description>Update factor is 1/16</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_GS_EN</name>
              <description>DC Residual Gearshift Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_GS_EN_0</name>
                  <description>Gearshifting disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_GS_EN_1</name>
                  <description>Gearshifting enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_DLY</name>
              <description>DC Residual Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_SECOND_RUN_EN</name>
              <description>DC Residual Second Run Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_SECOND_RUN_EN_0</name>
                  <description>Second Run disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_SECOND_RUN_EN_1</name>
                  <description>Second Run enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_EXT_DC_EN</name>
              <description>DC Residual External DC Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_EXT_DC_EN_0</name>
                  <description>External DC disable. The DC Residual activates at a delay specified by DC_RESID_DLY after an AGC gain change pulse. The DC Residual is initialized with a DC offset of 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_EXT_DC_EN_1</name>
                  <description>External DC enable. The DC residual activates after the DCOC's tracking hold timer expires. The DC Residual is initialized with the DC estimate from the DCOC tracking estimator.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_MIN_AGC_IDX</name>
              <description>DC Residual Minimum AGC Table Index</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_GEARSHIFT</name>
              <description>DC Residual Gearshift</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_RESID_CTRL2</name>
          <description>DC Residual Control2</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC_RESID_NWIN2</name>
              <description>DC Residual NWIN, for Second Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_PHY_STOP_EN</name>
              <description>DC Residual PHY Stop Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_CC_EN</name>
              <description>DC Residual Continuous Correction Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_SR2_EN</name>
              <description>DC Residual Slew rate Enable, for Second Run</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_ALPHA2</name>
              <description>DC Residual Alpha, for Second Run</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_0</name>
                  <description>Update factor is 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_1</name>
                  <description>Update factor is 1/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_2</name>
                  <description>Update factor is 1/4 + 1/8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_3</name>
                  <description>Update factor is 1/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_4</name>
                  <description>Update factor is 1/8 + 16</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_5</name>
                  <description>Update factor is 1/8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_6</name>
                  <description>Update factor is 1/16 + 1/32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_ALPHA2_7</name>
                  <description>Update factor is 1/16</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_GS2_EN</name>
              <description>DC Residual Gearshift Enable, for Second Run</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DC_RESID_GS2_EN_0</name>
                  <description>Gearshifting disabled for Second Run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DC_RESID_GS2_EN_1</name>
                  <description>Gearshifting enabled for Second Run</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DC_RESID_ITER_FREEZE2</name>
              <description>DC Residual Iteration Freeze, for Second Run</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_SLEWRATE2</name>
              <description>DC Residual Slew rate, for Second Run</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_MIN_AGC_IDX2</name>
              <description>DC Residual Minimum AGC Table Index, for Second Run</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_GEARSHIFT2</name>
              <description>DC Residual Gearshift, for Second Run</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_RESID_CTRL_DRS</name>
          <description>DC Residual Control DataRate1</description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC_RESID_NWIN</name>
              <description>DC Residual NWIN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_DLY</name>
              <description>DC Residual Delay</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DC_RESID_NWIN2</name>
              <description>DC Residual NWIN, for Second Run</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DC_RESID_EST</name>
          <description>DC Residual Estimate</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DC_RESID_OFFSET_I</name>
              <description>DC Residual Offset I</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DC_RESID_OFFSET_Q</name>
              <description>DC Residual Offset Q</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_TONE_ANALYZER0</name>
          <description>DfT tone analyzer</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPR_DFT_ANA_START_OFFSET_Q</name>
              <description>Q Initial Phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_START_OFFSET_I</name>
              <description>I Initial Phase</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_ATTENUATION_Q</name>
              <description>Tone Attenuation For Q Path</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_ATTENUATION_I</name>
              <description>Check description of ipr_dft_ana_attenuation_q</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_EN</name>
              <description>Enable for DfT tone analyzer</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFT_TONE_ANALYZER1</name>
          <description>DfT tone analyzer</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_TONE_ANA_ACCU_OVF</name>
              <description>Indicate the accumulator has overflow during measurement.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_TONE_ANA_BITSHIFT_OVF</name>
              <description>Indicate the accumulator input has overflow during measurement.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_BITSHIFT</name>
              <description>Accumulator input value scale down factor.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_TONE_ANA_DONE</name>
              <description>Read only status bit. Indicating the tone analyze finished.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_START</name>
              <description>Set 1 to trig the DFT Tone Analyzer</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_INPUT_SEL_2</name>
              <description>Should always set 2 for this field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_INPUT_SEL_1</name>
              <description>Should always set 0 for this field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_INCREMENT</name>
              <description>ipr_dft_ana_increment and ipr_dft_ana_clk_div determines the tone frequency</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPR_DFT_ANA_CLK_DIV</name>
              <description>Clock divider factor for tone generator. Check ipr_dft_ana_increment for more information.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPR_DFT_ANA_CLK_DIV_0</name>
                  <description>ref_clk</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPR_DFT_ANA_CLK_DIV_1</name>
                  <description>ref_clk div 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPR_DFT_ANA_CLK_DIV_2</name>
                  <description>ref_clk div 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPR_DFT_ANA_CLK_DIV_3</name>
                  <description>ref_clk div 8</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPR_DFT_ANA_CLK_DIV_4</name>
                  <description>ref_clk div 16</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
