nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XCVR_2P4GHZ_PHY</name>
      <description>2.4GHz PHY REGISTERS</description>
      <groupName>GEN4PHY</groupName>
      <baseAddress>0xA9107600</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FSK_PD_CFG0</name>
          <description>PHY Uncoded Preamble Detect Config 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE_T_SCALE</name>
              <description>Scaling factor used for fractional time estimation during preamble search.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_IIR_ALPHA</name>
              <description>Forgetting factor used by the complex correlations smoothing leaky integrator.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_PD_CFG1</name>
          <description>PHY Uncoded Preamble Detect Config 1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREAMBLE_PATTERN</name>
              <description>8-bit preamble pattern used in FM-domain preamble detector.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_PD_CFG2</name>
          <description>PHY Uncoded Preamble Detect Config 2</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PD_THRESH_ACQ_1_3_1M</name>
              <description>Preamble detect threshold for acq mode 1 and 3 at data rate 1Mbps</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PD_THRESH_ACQ_1_3_2M</name>
              <description>Preamble detect threshold for acq mode 1 and 3 at data rate 2Mbps</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>FSK_PD_PH%s</name>
          <description>PHY Uncoded Preamble Detect Phase</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF0</name>
              <description>Uncoded preamble reference waveform sample 0 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF1</name>
              <description>Uncoded preamble reference waveform sample 1 (sfix6en5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2</name>
              <description>Uncoded preamble reference waveform sample 2 (sfix6en5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF3</name>
              <description>Uncoded preamble reference waveform sample 3 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>2,3,4,5</dimIndex>
          <name>FSK_PD_RO_PH%s</name>
          <description>PHY Uncoded Preamble Detect Read Only Phase</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF0</name>
              <description>Uncoded preamble reference waveform sample 16 (sfix6en5)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF1</name>
              <description>Uncoded preamble reference waveform sample 17 (sfix6en5)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF2</name>
              <description>Uncoded preamble reference waveform sample 18 (sfix6en5)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF3</name>
              <description>Uncoded preamble reference waveform sample 19 (sfix6en5)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_CFG0</name>
          <description>PHY Uncoded Config 0</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AA_OUT_SEL</name>
              <description>Specifies which AA bits to be played-back to the LL:</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>output the received AA bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>output the programmed AA bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSK_BIT_INVERT</name>
              <description>This applies at the demodulator, so it affects both AA and the data portions of the packet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>Normal demodulation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>Invert demodulated bits</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSK_EN</name>
              <description>Configures PHY for MSK decoding.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSK2FSK_SEED</name>
              <description>Last bit of preamble.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA_ACQ_1_2_3_THRESH_1M</name>
              <description>For 1Mbps data rate, Correlation threshold applicable to AA detection; uses ufix5_En5 fixed-point format.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HAMMING_AA_LOW_PWR</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match; valid range [0,7]. This threshold value are performed on lower power case.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_NTW_ADR_THR</name>
              <description>Maximum hamming distance from the given AA pattern that may still be accepted as a match; valid range [0,7].</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AA_ACQ_1_2_3_THRESH_2M</name>
              <description>For 2Mbps data rate, correlation threshold applicable to AA detection; uses ufix5_En5 fixed-point format.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_CFG1</name>
          <description>PHY Uncoded Config 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OVERH</name>
              <description>Modulation index; represented in ufix11_En6 format.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERH_INV</name>
              <description>Reciprocal of modulation index; represented in ufix9_En7 format.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCTSCALE</name>
              <description>Scaling factor used for fractional time estimation during AA search; represented in ufix4_En3 format.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_CFG2</name>
          <description>PHY Uncoded Config 2</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAG_WIN</name>
              <description>Indicates the forgetting factor used in received signal level measurement;</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_PT</name>
          <description>PHY Uncoded Power Threshold Config</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AGC_TIMEOUT</name>
              <description>Time-out, applicable to special conditioning of signal power detection in the Power threshold block, after each AGC gain adjustment. It is expressed in number of samples.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COND_SIG_PRST_EN</name>
              <description>Enables special conditioning of signal detection;</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COND_AA_BUFF_EN</name>
              <description>Enables special condition for enabling AA detector buffer;</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPASS_WITH_RSSI</name>
              <description>Bypass signal power measurement with RSSI measurement;</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>no</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_FAD_CTRL</name>
          <description>PHY Uncoded FAD Control</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAD_EN</name>
              <description>Enables FAD;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_FAD_CFG</name>
          <description>PHY Uncoded FAD Config</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WIN_FAD_WAIT_SYNCH</name>
              <description>Time-window to wait for clean samples, before transitioning to AA search PHY state, if PD was found after antenna switch , in sample clock cycles(referred to as T3 in the PHY state-machine section).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIN_FAD_WAIT_PD</name>
              <description>Time-window to wait for clean samples if PD was not found after antenna switch , in sample clock cycles(referred to as T2 in the PHY state-machine section).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIN_FAD_SEARCH_PD</name>
              <description>Time-window to match preamble pattern on samples coming from the previously selected antenna , in sample clock cycles(referred to as T1 in the PHY state-machine section).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIN_SEARCH_PD</name>
              <description>Time-window to match preamble pattern on samples coming from the currently selected antenna, in sample clock cycles (referred to as T0 in the PHY state-machine section).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FSK_STAT</name>
          <description>PHY Uncoded Status</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EXT_TO_MODES_13</name>
              <description>Indicates Timeout extension for modes 1 et 3</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_FOUND</name>
              <description>Indicates that a uncoded AA detect is active.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LAST_AA_BIT</name>
              <description>reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AA_MATCH</name>
              <description>Indicates which non-coded AA has matched. This will clear when the PHY is re-initialized.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HAMM_DIST</name>
              <description>Indicates the hamming distance witnessed when AA match occurred.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORR_MAX</name>
              <description>Indicates the correlation witnessed when AA match occurred</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOF_OFF</name>
              <description>Timing offset for use in time-of-flight calculation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LR_PD_CFG</name>
          <description>PHY Long Range Preamble Detect Config</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CORR_TH</name>
              <description>Correlation threshold applicable to preamble detection; uses (0,8,8) fixed-point format.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_TH</name>
              <description>Threshold used to compare CFO estimates in the LR preamble detector; uses ufix5_En5 format.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_PEAKS</name>
              <description>Number of consecutive correlation values that have to exceed the PD correlation threshold,for the same preamble phase, to assert preamble found;</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0</name>
                  <description>2 peaks;</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1</name>
                  <description>3 peaks;</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2</name>
                  <description>4 peaks;</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A3</name>
                  <description>5 peaks;</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
