nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB6/KW47B42ZB6_cm33_core1.xml
        <register>
          <name>TIMING17</name>
          <description>TSM_TIMING17</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B580000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_DIG_EN_RX_HI</name>
              <description>Assertion time setting for RX_DIG_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DIG_EN_RX_LO</name>
              <description>De-assertion time setting for RX_DIG_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING18</name>
          <description>TSM_TIMING18</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B580000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_PHY_EN_RX_HI</name>
              <description>Assertion time setting for RX_PHY_EN (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_PHY_EN_RX_LO</name>
              <description>De-assertion time setting for RX_PHY_EN (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING19</name>
          <description>TSM_TIMING19</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11001100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_CAL (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_CAL (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_CAL (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_CAL_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_CAL (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING20</name>
          <description>TSM_TIMING20</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11001100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDOTRIM_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_LDOTRIM_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDOTRIM_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_LDOTRIM_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDOTRIM_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_LDOTRIM_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDOTRIM_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_LDOTRIM_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING21</name>
          <description>TSM_TIMING21</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x19001100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDO_CAL_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_LDO_CAL_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_CAL_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_CAL_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_CAL_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_LDO_CAL_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_CAL_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_CAL_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING22</name>
          <description>TSM_TIMING22</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x58006F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_FC_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_FC (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_FC_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_FC (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_FC_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_FC (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_FC_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_FC (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING23</name>
          <description>TSM_TIMING23</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x58006F00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDO_GANG_FC_TX_HI</name>
              <description>Assertion time setting for SEQ_LDO_GANG_FC (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_FC_TX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_(PLL/RXTXHF/RXTXLF/VCO)_FC (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_FC_RX_HI</name>
              <description>Assertion time setting for SEQ_LDO_(PLL/RXTXHF/RXTXLF/VCO)_FC (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_FC_RX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_(PLL/RXTXHF/RXTXLF/VCO)_FC (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING24</name>
          <description>TSM_TIMING24</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B007100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDO_GANG_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_LDO_(ANT/PLL/RXTXHF/RXTXLF/VCO/XO_DIST)_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_(ANT/PLL/RXTXHF/RXTXLF/VCO/XO_DIST)_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_LDO_(ANT/PLL/RXTXHF/RXTXLF/VCO/XO_DIST)_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_GANG_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_(ANT/PLL/RXTXHF/RXTXLF/VCO/XO_DIST)_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING25</name>
          <description>TSM_TIMING25</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C007200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_LDO_LV_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_LDO_LV_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_LV_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_LV_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_LV_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_LDO_LV_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_LDO_LV_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_LDO_LV_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING26</name>
          <description>TSM_TIMING26</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C007200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING27</name>
          <description>TSM_TIMING27</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C007200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_ANT (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_ANT (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_ANT (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_ANT_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_ANT (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING28</name>
          <description>TSM_TIMING28</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C007200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_XO_DIST (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_XO_DIST (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_XO_DIST (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_XO_DIST_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_XO_DIST (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING29</name>
          <description>TSM_TIMING29</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF7200</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_TX (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_TX (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_TX (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_TX_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_TX (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING30</name>
          <description>TSM_TIMING30</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5C00FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_TX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_RX (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_TX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_RX (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_RX_HI</name>
              <description>Assertion time setting for SEQ_BG_PUP_IBG_RX (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_BG_PUP_IBG_RX_RX_LO</name>
              <description>De-assertion time setting for SEQ_BG_PUP_IBG_RX (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING31</name>
          <description>TSM_TIMING31</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5B087108</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_TX_HI</name>
              <description>Assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_TX_LO</name>
              <description>De-assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_RX_HI</name>
              <description>Assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_TSM_ISO_B_2P4GHZ_RX_LO</name>
              <description>De-assertion time setting for SEQ_TSM_ISO_B_2P4GHZ (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING32</name>
          <description>TSM_TIMING32</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1911FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQ_RCCAL_PUP_TX_HI</name>
              <description>Assertion time setting for SEQ_RCCAL_PUP (TX)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_TX_LO</name>
              <description>De-assertion time setting for SEQ_RCCAL_PUP (TX)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_RX_HI</name>
              <description>Assertion time setting for SEQ_RCCAL_PUP (RX)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEQ_RCCAL_PUP_RX_LO</name>
              <description>De-assertion time setting for SEQ_RCCAL_PUP (RX)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
